### Topics for today
#### 1) What is dataframe?
#### 2) Create dataframe from csv file and python dictionary
#### 3) Dealing with rows and columns
#### 4) Operations: mean, max, std, describe
#### 5) Conditional selection
#### 6) set_index function and usefulness of it

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Book1.csv")

In [3]:
df

      day  temperature  windspeed events
0  1/1/17           28          6   Rain
1  1/2/17           22          5   Snow
2  1/3/17           10          1   Snow
3  1/4/17            1          9  Sunny
4  1/5/17           33          5   Rain
5  1/6/17           40          2   Snow

In [4]:
#Using a dictionary to create a dataframe
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temperature': [32,35,28,24,32,31],
    'windspeed': [6,7,2,7,4,2],
    'event': ['Rain', 'Sunny', 'Snow','Snow','Rain', 'Sunny']
}

df1= pd.DataFrame(weather_data)
df1

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [6]:
#Since df.shape is a tuple
rows, columns = df.shape
print(rows)
print(columns)

6
4

In [7]:
df1.head(3)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [8]:
df.tail()

      day  temperature  windspeed events
1  1/2/17           22          5   Snow
2  1/3/17           10          1   Snow
3  1/4/17            1          9  Sunny
4  1/5/17           33          5   Rain
5  1/6/17           40          2   Snow

In [9]:
df

      day  temperature  windspeed events
0  1/1/17           28          6   Rain
1  1/2/17           22          5   Snow
2  1/3/17           10          1   Snow
3  1/4/17            1          9  Sunny
4  1/5/17           33          5   Rain
5  1/6/17           40          2   Snow

In [10]:
df[2:5]

      day  temperature  windspeed events
2  1/3/17           10          1   Snow
3  1/4/17            1          9  Sunny
4  1/5/17           33          5   Rain

In [11]:
df.columns

Index(['day', 'temperature', 'windspeed', 'events'], dtype='object')

In [13]:
df.temperature

0    28
1    22
2    10
3     1
4    33
5    40
Name: temperature, dtype: int64

In [14]:
df.day

0    1/1/17
1    1/2/17
2    1/3/17
3    1/4/17
4    1/5/17
5    1/6/17
Name: day, dtype: object

In [16]:
df[['day','temperature']]

      day  temperature
0  1/1/17           28
1  1/2/17           22
2  1/3/17           10
3  1/4/17            1
4  1/5/17           33
5  1/6/17           40

In [17]:
df['temperature'].max()

40

In [18]:
df['temperature'].mean()

22.333333333333332

In [19]:
df['temperature'].std()

14.596803303006677

In [20]:
df['temperature'].min()

1

In [23]:
#This will work on columns which have integer data.
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     22.333333   4.666667
std      14.596803   2.875181
min       1.000000   1.000000
25%      13.000000   2.750000
50%      25.000000   5.000000
75%      31.750000   5.750000
max      40.000000   9.000000

In [24]:
df

      day  temperature  windspeed events
0  1/1/17           28          6   Rain
1  1/2/17           22          5   Snow
2  1/3/17           10          1   Snow
3  1/4/17            1          9  Sunny
4  1/5/17           33          5   Rain
5  1/6/17           40          2   Snow

In [26]:
#Just like SQL, we are applying some condition on the rows and printing the df
df[df['windspeed']>2]

      day  temperature  windspeed events
0  1/1/17           28          6   Rain
1  1/2/17           22          5   Snow
3  1/4/17            1          9  Sunny
4  1/5/17           33          5   Rain

In [31]:
df[['day','events']][df['temperature']== df['temperature'].max()]

      day events
5  1/6/17   Snow

In [32]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [34]:
df.set_index('day')

        temperature  windspeed events
day
1/1/17           28          6   Rain
1/2/17           22          5   Snow
1/3/17           10          1   Snow
1/4/17            1          9  Sunny
1/5/17           33          5   Rain
1/6/17           40          2   Snow

In [35]:
df

      day  temperature  windspeed events
0  1/1/17           28          6   Rain
1  1/2/17           22          5   Snow
2  1/3/17           10          1   Snow
3  1/4/17            1          9  Sunny
4  1/5/17           33          5   Rain
5  1/6/17           40          2   Snow

In [36]:
df.set_index('day', inplace=True)

In [37]:
df

        temperature  windspeed events
day
1/1/17           28          6   Rain
1/2/17           22          5   Snow
1/3/17           10          1   Snow
1/4/17            1          9  Sunny
1/5/17           33          5   Rain
1/6/17           40          2   Snow

In [40]:

df.loc['1/3/17','events']

'Snow'

In [41]:
df.reset_index(inplace=True)

In [42]:
df

      day  temperature  windspeed events
0  1/1/17           28          6   Rain
1  1/2/17           22          5   Snow
2  1/3/17           10          1   Snow
3  1/4/17            1          9  Sunny
4  1/5/17           33          5   Rain
5  1/6/17           40          2   Snow

In [48]:
df.loc[:,['windspeed','events']]

   windspeed events
0          6   Rain
1          5   Snow
2          1   Snow
3          9  Sunny
4          5   Rain
5          2   Snow

In [49]:
df.set_index("events", inplace=True)

In [50]:
df

           day  temperature  windspeed
events
Rain    1/1/17           28          6
Snow    1/2/17           22          5
Snow    1/3/17           10          1
Sunny   1/4/17            1          9
Rain    1/5/17           33          5
Snow    1/6/17           40          2

In [55]:
df.loc['Snow']

           day  temperature  windspeed
events
Snow    1/2/17           22          5
Snow    1/3/17           10          1
Snow    1/6/17           40          2

In [59]:
#creating a dataframe using list of tuples
weather_data = [
    ('1/1/2017',32,6,'Rain'),
    ('1/2/2017',35,7,'Sunny'),
    ('1/3/2017',28,2,'Snow')
]

df3= pd.DataFrame(data=weather_data, columns=['Date','Temperature','Windspeed','Event'] )
df3

       Date  Temperature  Windspeed  Event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [61]:
#Creating a data frame using list of dictionary
weather_data = [
    {'day': '1/1/2017', 'temperature': 32, 'windspeed': 6, 'event': 'Rain'},
    {'day': '1/2/2017', 'temperature': 35, 'windspeed': 7, 'event': 'Sunny'},
    {'day': '1/3/2017', 'temperature': 28, 'windspeed': 2, 'event': 'Snow'},
    
]
df4= pd.DataFrame(weather_data)
df4

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [62]:
#Pandas IO and Pandas series for further documentation.

### This tutorial covers how to read/write excel and csv files in pandas. We will cover,
### 1) Different options on cleaning up messy data while reading csv/excel files
### 2) Use convertors to transform data read from excel file
### 3) Export only portion of dataframe to excel file

In [64]:
df = pd.read_csv('stock_data.csv')
df

  stock_data     Unnamed: 1 Unnamed: 2 Unnamed: 3     Unnamed: 4
0    tickers            eps    revenue      price         people
1      GOOGL          27.82         87        845     larry page
2        WMT           4.61        484         65           n.a.
3       MSFT             -1         85         64     bill gates
4       RIL   not available         50       1023  mukesh ambani
5       TATA            5.6         -1       n.a.     ratan tata

In [68]:
df = pd.read_csv('stock_data.csv', header=None)
df

       0              1    2     3              4
0  GOOGL          27.82   87   845     larry page
1    WMT           4.61  484    65           n.a.
2   MSFT             -1   85    64     bill gates
3   RIL   not available   50  1023  mukesh ambani
4   TATA            5.6   -1  n.a.     ratan tata

In [70]:
df = pd.read_csv('stock_data.csv',header=None, names=['tickers','eps','revenue','price','people'],nrows=3)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [79]:
df = pd.read_csv('stock_data.csv', 
                 na_values={
                     'eps':['not available', 'n.a.'],
                     'revenue':['not available', 'n.a.',-1],
                     'people':['not available', 'n.a.'],
                     'price':['n.a.']
                 })
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [81]:
#Saving the data above to a csv file in local directory

df.to_csv('updated_stock_data.csv', index=False)

In [82]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [84]:
#Saving specific columns to a csv file
df.to_csv("column_specific_stock_data.csv", columns=['tickers', 'eps', 'revenue'], index=False)

### Working with Excel file.

In [85]:
df= pd.read_excel("excel_stock_data.xlsx")
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [108]:
#We see that in 2nd row under people column there is NaN value, however we know the CEO of walmart so using 
# read_excel we can convert NaN into the actual name of the CEO of Walmart.
def convert_people_cell(cell):
   # print(type(cell))
    #print(dir(cell))
    print(len(cell))
    if len(cell) == 0 :
        return 'Sam Walton'
    else:
        return cell


df = pd.read_excel("excel_stock_data.xlsx", "Sheet1", converters={
    'people': convert_people_cell
})
df

10
0
10
13
10

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0     Sam Walton
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [98]:
df.to_excel("updated_excel_stock_data.xlsx", sheet_name="stocks", index=False)

In [113]:
x=[]
x==[]

True